#MarkDown相关问题整理
www.markdown.cn官方使用手册

## 1.MarkDown是什么
轻量级标记语言；标记语法代替常见排版方法

## 2.MarkDown的特点
（优点：纯文本内容，兼容所有文本编辑器与字处理软件  
        可放到版本管理系统中，追踪历史变更  
        轻松导出HTML、PDF和本身的.md文件  
        简洁、高效、可读、直观、学习成本低  
        专注文字内容而不是排版样式，安心写作）  

特点：兼容HTML，在线观看，平台支持，排版样式简单

## 3.MarkDown的用途
IT人士：写日志、技术文稿、记录代码片段、撰写文档  
科研人员/学生：撰写科技论文、记笔记  
求职者：制作求职履历  
其他：撰写博文、在线编辑文章等  

## 4.MarkDown的编辑工具有哪些
Mac OS X：Mou  
Windows：MarkdownPad、MarkPad  
Linux：ReText  
Web：简书、github、有道云笔记  

## 5.MarkDown的区块元素和区段元素分别包含哪些
标题，文字修饰（加粗、斜体），无序列表，有序列表，链接，内嵌图片  
表格，TaskList，代码块，引用，流程图，甘特图

区块元素：段落和换行，标题，区块引用，列表，代码区块，分隔线  
区段元素：链接，强调，行内标记，插入图片  
其他：反斜杠，自动邮箱链接  
