# 一、设计基础

## 1. 什么是设计？
有目的地策划

## 2. 哪些属于设计范畴：
平面设计、软件设计、工业设计、概念设计、产品设计等

## 3. 用户界面（UI）设计是什么？
针对电子产品界面的设计，是一个复杂的有不同学科参与的工程

## 4. 界面设计三大原则
置界面于用户的控制之下；减少用户记忆负担；保持界面一致性

## 5. 用户界面设计的组成部分
结构设计（概念设计）；交互设计；视觉设计

## 6. 结构设计的分类
系统；网页

## 7. 什么是交互设计
任何产品功能的实现都是通过人和机器的交互来完成的

## 8. 用户界面（UI）设计工作流程
需求调研-模块分析-结构设计-交互设计-视觉设计-界面级源代码-维护和测试

## 9. 用户界面（UI）设计的发展方向
交互设计师；视觉设计师；测试工程师；系统架构师



# 二、UI设计常识

## 1. UI是哪两个单词的简称
User Interface

## 2. 什么是VI系统
企业视觉识别系统，是企业文化宣传的重要组成部分

## 3. VI设计原则包括？
同一性，差异性，文化性，有效性

## 4. VI系统包含哪两部分
基本要素系统；应用系统

## 5. 对于logo的合法的两种更改
等比例缩放；反白

## 6. 色彩模式有哪两种
RGB模式；CMYK模式

## 7. 图片格式有哪两种？
位图；矢量图

## 8. 两种图片格式的特点是？
位图：是使用像素的一格一格的小点来描述图像的，不可无限放大，UI常用  
矢量图：使用线段和曲线描述图像，所以成为矢量，同时图形也包含了色彩和位置信息，可无损耗无限放大，印刷品常用

## 9. 两种图片格式分别常用的扩展名为？
位图：*.jpg；*.gif；*.png  
矢量图：*.ai；*.eps；*.cdr

## 10. 可用性设计体现在哪三个方面
内容布局；使用人性化；美观

## 11. 常用到的网络资源有
图片，小图标，文字，代码，音乐，动画，其他

## 12. 客户交流时的注意事项
你永远比客户专业；永远要保持礼貌；要让客户知道你做了哪些工作



# 三、UI设计流程

## 1. 前期需求阶段，UI设计所需要考虑的四个问题
需求分析；栏目排版；色彩搭配；风格设计

## 2. UI设计在需求分析阶段需要注意的问题？
网站制作目标；网站所处行业；网站包含内容；网站使用人群

## 3. 在栏目排版时，首页内容通常包含哪些部分？
主题栏：包括LOGO、bannner  
更新栏：新闻内容、信息等  
指南栏：导航条、搜索栏、网站地图等  
交流栏：网站设计、留言板等  
广告栏：广告发布等  

## 4. 色彩搭配时需要注意的问题
蓝色忌纯，绿色忌黄，红色忌艳

## 5. 中期设计阶段需要做的工作有哪些？
设计工具选择；设计制作；布局方式；样式定义；交流沟通

## 6. 设计效果图时需注意的问题？
尽量多用可循环较小的背景图，少用整张大图  
尽量多用填充色，少用图片  
尽量多用系统字体，少用特殊字体  
大面积使用的颜色尽量不超过三个色系  

## 7. 前端页面的设计中，html、css和javascript分别的作用是？
html：设计页面格式  
css：设计页面样式  
javascript：设计页面动画  
 
